In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = pd.read_csv('StudentsPerformance.csv')

In [7]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [6]:
students_performance.groupby('gender', as_index=False).aggregate({'writing score': 'mean', 'reading score': 'std'})

   gender  writing score  reading score
0  female      72.467181      14.378245
1    male      63.311203      13.931832

In [11]:
groups2 = students_performance.groupby(['gender', 'race/ethnicity']).describe()

In [13]:
groups2.loc[('female', 'group C')]

math score     count    180.000000
               mean      62.033333
               std       15.007224
               min        0.000000
               25%       53.000000
               50%       63.000000
               75%       71.000000
               max       96.000000
reading score  count    180.000000
               mean      71.944444
               std       13.900574
               min       17.000000
               25%       63.750000
               50%       73.000000
               75%       81.250000
               max      100.000000
writing score  count    180.000000
               mean      71.777778
               std       14.806595
               min       10.000000
               25%       63.750000
               50%       74.000000
               75%       82.000000
               max      100.000000
Name: (female, group C), dtype: float64

In [16]:
students_performance['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [17]:
students_performance.groupby(['gender', 'race/ethnicity'])['math score'].nunique()

gender  race/ethnicity
female  group A           29
        group B           51
        group C           59
        group D           53
        group E           44
male    group A           38
        group B           43
        group C           56
        group D           49
        group E           38
Name: math score, dtype: int64

In [31]:
students_performance.sort_values(['gender', 'math score'], ascending=False).groupby('gender').head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100

In [32]:
students_performance['total score'] = students_performance['math score'] + students_performance['reading score'] + students_performance['writing score']

In [36]:
students_performance = students_performance.assign(total_score_log = np.log(students_performance['total score']))

In [37]:
students_performance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score,total_score_log
0,female,group B,bachelor's degree,standard,none,72,72,74,218,5.384495
1,female,group C,some college,standard,completed,69,90,88,247,5.509388
2,female,group B,master's degree,standard,none,90,95,93,278,5.627621
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4.997212
4,male,group C,some college,standard,none,76,78,75,229,5.433722
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282,5.641907
996,male,group C,high school,free/reduced,none,62,55,55,172,5.147494
997,female,group C,high school,free/reduced,completed,59,71,65,195,5.273000
998,female,group D,some college,standard,completed,68,78,77,223,5.407172
999,female,group D,some college,free/reduced,none,77,86,86,249,5.517453

In [40]:
students_performance.drop(['total score', 'lunch'], axis=1)

,gender,race/ethnicity,parental level of education,test preparation course,math score,reading score,writing score,total_score_log
0,female,group B,bachelor's degree,none,72,72,74,5.384495
1,female,group C,some college,completed,69,90,88,5.509388
2,female,group B,master's degree,none,90,95,93,5.627621
3,male,group A,associate's degree,none,47,57,44,4.997212
4,male,group C,some college,none,76,78,75,5.433722
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,completed,88,99,95,5.641907
996,male,group C,high school,none,62,55,55,5.147494
997,female,group C,high school,completed,59,71,65,5.273000
998,female,group D,some college,completed,68,78,77,5.407172
999,female,group D,some college,none,77,86,86,5.517453

In [46]:
#task 1
dota = pd.read_csv('dota_hero_stats.csv')
dota.groupby('legs').count()

      Unnamed: 0  attack_type  id  localized_name  name  primary_attr  roles
legs
0             11           11  11              11    11            11     11
2             95           95  95              95    95            95     95
4              7            7   7               7     7             7      7
6              3            3   3               3     3             3      3
8              1            1   1               1     1             1      1

In [73]:
#task 2
account = pd.read_csv('accountancy.csv')
acc_res = account.groupby(['Executor', 'Type']).mean()
acc_res.loc[('Loopa', 'A'), 'Salary']

['D', 'A', 'E', 'F', 'B', 'C']

In [78]:
arr = dict()
for i in sorted(list(account['Type'].unique())):
    if acc_res.loc[('Loopa', i), 'Salary'] > acc_res.loc[('Pupa', i), 'Salary']:
        arr[i] = 'Loopa'
    else:
        arr[i] = 'Pupa'
arr

{'A': 'Pupa',
 'B': 'Loopa',
 'C': 'Loopa',
 'D': 'Pupa',
 'E': 'Loopa',
 'F': 'Loopa'}

In [80]:
#task 3
dota.groupby(['attack_type', 'primary_attr']).count()

                          Unnamed: 0  id  legs  localized_name  name  roles
attack_type primary_attr
Melee       agi                   19  19    19              19    19     19
            int                    2   2     2               2     2      2
            str                   35  35    35              35    35     35
Ranged      agi                   18  18    18              18    18     18
            int                   40  40    40              40    40     40
            str                    3   3     3               3     3      3

In [84]:
algae = pd.read_csv('http://stepik.org/media/attachments/course/4852/algae.csv')

SyntaxError: invalid syntax (<ipython-input-84-a505ab4b356d>, line 2)

In [85]:
algae.groupby('genus').aggregate({'sucrose': 'mean', 'sucrose':'mean', 'citrate': 'mean', 'glucose': 'mean', 'oleic_acid': 'mean'})

              sucrose   citrate   glucose  oleic_acid
genus
Ascophyllum  6.825467  5.253527  3.414961    2.432526
Cladophora   4.008792  5.288311  2.800276    2.263472
Fucus        4.355112  4.214878  2.814803    3.367647
Palmaria     0.704580  5.573905  3.242090    2.245538
Saccharina   4.183596  3.346710  4.980594    4.487252

In [87]:
algae.groupby('genus').aggregate({'alanin': 'describe'})

            alanin                                                    \
             count      mean       std       min       25%       50%
genus
Ascophyllum    1.0  0.875429       NaN  0.875429  0.875429  0.875429
Cladophora     3.0  3.997055  2.657050  1.648450  2.555071  3.461692
Fucus          3.0  3.566411  3.149943  0.346431  2.028965  3.711498
Palmaria       1.0  3.176440       NaN  3.176440  3.176440  3.176440
Saccharina     2.0  3.524207  3.208789  1.255251  2.389729  3.524207


                  75%       max
genus
Ascophyllum  0.875429  0.875429
Cladophora   5.171358  6.881024
Fucus        5.176401  6.641303
Palmaria     3.176440  3.176440
Saccharina   4.658685  5.793163

In [93]:
algae_max = algae.groupby('group').aggregate({'glucose': 'max'})
algae_min = algae.groupby('group').aggregate({'glucose': 'min'})

In [94]:
algae_min

        glucose
group
brown  2.272724
green  2.316955
red    3.242090

In [95]:
algae_max

        glucose
group
brown  6.013219
green  3.343707
red    3.242090